{
  "dashboard": {
    "text": "ساختار داده ها و الگوریتم ها را بیاموزید",
    "subText": "آموزش آنلاین با سرعت خودتان با ما دوره DSA. اصول اولیه DSA را فرا بگیرید و سوالات مصاحبه ساختار داده را با VisualDSA خود گام تمرین کنید.",
    "about": "درباره",
    "login": "وارد شدن",
    "courses": "دوره های آموزشی"
  },
  "topNavBar": {
    "logout": "Logout",
    "language": "زبان",
    "menu": "Menu",
    "moreMenu": "More Menu"
  },
  "sideBarMenu": {
    "dataStructure": "Data Structure",
    "stack": "Stack",
    "queue": "Queue",
    "linkedList": "Linked List",
    "hashTable": "Hash Table",
    "bubbleSort": "Bubble Sort",
    "insertionSort": "Insertion Sort",
    "selectionSort": "Selection Sort",
    "mergeSort": "Merge Sort",
    "heapSort": "Heap Sort"
  },

  "stack": {
    "stack": "سبد",
    "text1": "سبد یک ساختار داده خطی است که از ترتیب خاصی پیروی می کند که در آن عملیات انجام می شود.",
    "text2": ":LIFO (آخرین ورود اول)",
    "text3": ".این استراتژی بیان می کند که عنصری که آخرین بار درج شده است ابتدا بیرون می آید. می‌توانید انبوهی از بشقاب‌ها را که روی هم نگه داشته شده‌اند، به‌عنوان مثال واقعی در نظر بگیرید. صفحه ای که آخر گذاشتیم روی آن است و از آنجایی که صفحه ای که در بالا قرار دارد را برداریم، می توانیم بگوییم که صفحه ای که آخر گذاشته شده است اول بیرون می آید.",
    "text4": "سفارش ممکن است LIFO (آخرین خروج اول) یا FILO (اول در آخرین خروج) باشد. نمونه های واقعی زیادی از یک پشته وجود دارد. نمونه ای از بشقاب هایی را که در غذاخوری روی هم چیده شده اند در نظر بگیرید. صفحه ای که در بالا قرار دارد اولین صفحه ای است که برداشته می شود، یعنی صفحه ای که در پایین ترین موقعیت قرار گرفته است برای طولانی ترین مدت زمان در پشته باقی می ماند. بنابراین، می توان به سادگی مشاهده کرد که به ترتیب LIFO(آخرین خروج)/FILO(اول در آخرین خروج).",
    "text5": "عملیات پایه روی پشته",
    "text6": ".برای انجام دستکاری در یک پشته، عملیات خاصی در اختیار ما قرار می گیرد",
    "text7": "push() برای وارد کردن یک عنصر در پشته",
    "text8": "pop() برای حذف یک عنصر از پشته",
    "text9": "top() عنصر بالای پشته را برمی گرداند",
    "text10": ".() isEmpty اگر پشته خالی باشد true برمی گرداند و در غیر اینصورت false",
    "text11": ".size() اندازه پشته را برمی گرداند",
    "text12": "فشار دادن",
    "text13": ".یک مورد را به پشته اضافه می کند. اگر پشته پر باشد، گفته می شود که یک شرط Overflow است",
    "text14": ":الگوریتم برای فشار",
    "text15": "ترکیدن:",
    "text16": ".یک مورد را از پشته حذف می کند. آیتم ها به ترتیب معکوس که در آن هل داده می شوند ظاهر می شوند. اگر پشته خالی باشد، گفته می شود که یک شرط Underflow است",
    "text17": ":الگوریتم پاپ",
    "text18": "کاربردهای ساختار داده پشته",
    "text19": ":در زیر کاربردهای مختلف Stack در ساختار داده آورده شده است",
    "text20": "ارزیابی عبارات حسابی",
    "text21": "عقب نشینی",
    "text22": "بررسی جداکننده",
    "text23": "معکوس کردن یک داده",
    "text24": "پردازش تماس های تابع",
    "text25": "پاک کردن",
    "text26": "پاپ",
    "text27": "فشار دادن",
    "text28": "مقدار خارج شده",
    "text29": "بالاترین",
    "text30": "آزمون دادن"
  },

  "queue": {
    "queue": "صف",
    "text1": ".صف یک ساختار داده خطی است که عناصر را به صورت متوالی ذخیره می کند. از رویکرد FIFO (First In First Out) برای دسترسی به عناصر استفاده می کند. صف ها معمولاً برای مدیریت رشته ها در چند رشته ای و پیاده سازی سیستم های صف اولویت استفاده می شوند. در این مقاله با انواع ساختار داده صف، عملیات اساسی انجام شده بر روی آن، پیاده سازی و کاربردهای صف آشنا می شویم.",
    "text2": ".صف یک ساختار داده مهم در برنامه نویسی است. یک صف از روش FIFO (First In First Out) پیروی می کند و در هر دو انتهای آن باز است. درج داده ها در یک انتهای انتهای صف یا دم صف انجام می شود در حالی که حذف در انتهای دیگر به نام قسمت جلویی یا سر صف انجام می شود.",
    "text3": "مثال واقعی از ساختار داده صف",
    "text4": ".بیایید صفی از مردم را در نظر بگیریم که منتظر خرید بلیط در سالن سینما هستند. یک نفر جدید از انتها به صف می‌پیوندد و فردی که در جلو می‌ایستد اولین نفری است که بلیط را می‌گیرد و خط را ترک می‌کند. به طور مشابه در ساختار داده صف، داده‌هایی که ابتدا اضافه می‌شوند، ابتدا از صف خارج می‌شوند",
    "text5": ":برخی دیگر از کاربردهای صف در زندگی واقعی هستند",
    "text6": "افراد سوار بر پله برقی",
    "text7": "خط صندوق دار در یک فروشگاه",
    "text8": "یک خط کارواش",
    "text9": "یک طرفه خارج می شود"
  }
}
