{
  "dashboard": {
    "text": "د معلوماتو جوړښتونه او الګوریتم زده کړئ",
    "subText": ".زموږ سره په خپل سرعت آنلاین زده کړه د DSA کورس. د DSA اساسات ماسټر کړئ او د GFG DSA سره د ډیټا جوړښت مرکې پوښتنې تمرین کړئ",
    "about": "په اړه",
    "login": "ننوتل",
    "courses": "کورسونه"
  },
  "topNavBar": {
    "logout": "وتل",
    "language": "ژبه",
    "menu": "مینو",
    "moreMenu": "نور مینو"
  },
  "sideBarMenu": {
    "dataStructure": "Data Structure",
    "stack": "Stack",
    "queue": "Queue",
    "linkedList": "Linked List",
    "hashTable": "Hash Table",
    "bubbleSort": "Bubble Sort",
    "insertionSort": "Insertion Sort",
    "selectionSort": "Selection Sort",
    "mergeSort": "Merge Sort",
    "heapSort": "Heap Sort"
  },

  "stack": {
    "stack": "سټیک",
    "text1": "سټیک یو خطي ډیټا جوړښت دی چې یو ځانګړي ترتیب تعقیبوي چې عملیات په کې ترسره کیږي.",
    "text2": "LIFO (په لومړي سر کې وروستی):",
    "text3": "دا ستراتیژي وايي چې هغه عنصر چې وروستی داخل شوی وي لومړی به راشي. تاسو کولی شئ د ریښتیني ژوند مثال په توګه د یو بل په سر کې ساتل شوي پلیټونه واخلئ. هغه پلیټ چې موږ وروستی کېښودو په پورتنۍ برخه کې دی او له هغه وخته چې موږ هغه پلیټ لرې کوو چې په پورتنۍ برخه کې دی، موږ کولی شو ووایو چې هغه پلیټ چې وروستی کېښودل شوی لومړی راځي.",
    "text4": "شي LIFO (په لومړي سر کې وروستی) یا FILO (لومړی په وروستیو کې) وي. د سټیک ډیری ریښتیني ژوند مثالونه شتون لري. په کانټین کې د یو بل په سر د پلیټونو یوه بیلګه په پام کې ونیسئ. هغه پلیټ چې په پورتنۍ برخه کې دی لومړی هغه دی چې له مینځه وړل کیږي ، د بیلګې په توګه هغه پلیټ چې په ټیټ ځای کې ځای په ځای شوی د اوږدې مودې لپاره په سټک کې پاتې کیږي. نو، دا په ساده ډول لیدل کیدی شي چې د LIFO (په لومړي سر کې وروستی) / FILO (په وروستي کې لومړی) ترتیب تعقیب کړي.",
    "text5": "په سټیک باندې بنسټیز عملیات",
    "text6": "په یوه کڅوړه کې د لاسوهنې کولو لپاره، موږ ته ځینې عملیات چمتو شوي دي",
    "text7": "پش() په سټک کې د عنصر داخلولو لپاره",
    "text8": "پاپ () د سټیک څخه یو عنصر لرې کولو لپاره",
    "text9": "top() د سټیک پورتنۍ عنصر بیرته راګرځوي",
    "text10": "isEmpty() ریښتیا راګرځي که چیرې سټیک خالي وي او غلط وي",
    "text11": "size() د سټک اندازه راګرځوي",
    "text12": "ټیله کول",
    "text13": "سټیک ته یو توکي اضافه کوي. که چیرې سټیک ډک وي، نو دا د اوور فلو حالت ته ویل کیږي",
    "text14": "د فشار لپاره الګوریتم",
    "text15": "پاپ",
    "text16": "د سټیک څخه یو توکي لرې کوي. توکي په بدل شوي ترتیب کې پاپ شوي په کوم کې چې دوی فشار راوړي. که چیرې سټیک خالي وي، نو دا د زیرمو حالت ته ویل کیږي",
    "text17": "د پاپ لپاره الګوریتم",
    "text18": "د سټیک ډیټا جوړښت غوښتنلیکونه",
    "text19": "لاندې د ډیټا جوړښت کې د سټیک مختلف غوښتنلیکونه د",
    "text20": "د ریاضیاتو د څرګندونو ارزونه",
    "text21": "شاته تګ",
    "text22": "د ډیلیمیټر چک کول",
    "text23": "د معلوماتو بیرته راګرځول",
    "text24": "د پروسس کولو فنکشن کال",
    "text25": "پاک متن",
    "text26": "پاپ",
    "text27": "ټیله کول",
    "text28": ":پوپ شوی ارزښت",
    "text29": "پورته",
    "text30": "ازموینه ورکړئ"
  },
  "queue": {
    "queue": "قتار",
    "text1": "قطار یو خطي ډیټا جوړښت دی چې عناصر په ترتیب سره ذخیره کوي. دا عناصرو ته د لاسرسي لپاره د FIFO طریقه (لومړی په لومړي کې) کاروي. کتارونه په عمومي ډول د ملټي ریډینګ کې د تارونو اداره کولو او د لومړیتوب قطار سیسټمونو پلي کولو لپاره کارول کیږي. پدې مقاله کې به موږ د قطار ډیټا جوړښت مختلف ډولونه ، په دې باندې ترسره شوي لومړني عملیات ، پلي کول ، او د قطار غوښتنلیکونو په اړه زده کړو.",
    "text2": "قطار په پروګرام کولو کې د معلوماتو یو مهم جوړښت دی. یو کتار د FIFO (په لومړي کې لومړی بهر) میتود تعقیبوي او د هغې په دواړو پایونو کې خلاص دی. د ډیټا داخلول د قطار په یوه پای کې یا د قطار په پای کې ترسره کیږي پداسې حال کې چې حذف کول په بل سر کې ترسره کیږي چې د مخکینۍ پای یا د قطار سر په نوم یادیږي.",
    "text3": "د قطار ډیټا جوړښت ریښتیني ژوند مثال",
    "text4": "راځئ چې د سینما په تالار کې د ټکټ اخیستلو لپاره د خلکو یوه لیکه په پام کې ونیسو. یو نوی کس به له پای څخه په لیکه کې شامل شي او په مخ کې ولاړ کس به لومړی وي چې ټکټ واخلي او له لیکې څخه ووځي. په ورته ډول د قطار ډیټا جوړښت کې، لومړی اضافه شوي معلومات به لومړی قطار پریږدي.",
    "text5": "په ریښتیني ژوند کې د قطار ځینې نور غوښتنلیکونه په لاندې ډول دي:",
    "text6": "په تېښته کې خلک",
    "text7": "په پلورنځي کې د کیشیر لاین",
    "text8": "د موټر مینځلو لاین",
    "text9": "یوه لاره د وتلو"
  }
}
